04_OpenFoam/_ref/OpenFOAM-14/multiRegion/film/hotBoxes/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication -s fluid blockMesh -region fluid

runApplication decomposePar -region fluid -noFields

# Create the boxes and add their surfaces to the boxes patch
runParallel subsetMesh -region fluid -noFields

# Create the film mesh
runParallel extrudeToRegionMesh -region fluid

runApplication -s fields decomposePar -fields -copyZero

runParallel foamMultiRun

runApplication reconstructPar -allRegions

#------------------------------------------------------------------------------
